docs/Diameter.tex
% Created 2019-01-26 Sat 08:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern}
\author{adam}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={adam},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.2 (Org mode 9.1.7)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{getDiameters}
\label{sec:org5c48abe}
\subsection{input: im, skel}
\label{sec:orgbe4c976}
\subsection{output:}
\label{sec:orga343b54}
\subsection{algorithm}
\label{sec:org6658d2f}
\begin{enumerate}
\item create edm mask (euclidean distance map)
\item search for the main stem
a. find the "deepest" point
\begin{itemize}
\item The deepest point is the point with the largest edm value.  I
call it deep because it is further away from the edges.
\item This is done via a max search of the edm
\end{itemize}
b. from the deepest point (wmax, hmax) follow to the stem root
c. at each height, find the left and right extents by walking until
   left until reaching a zero, similarly for the right extent
d. compute the mid of left and right boundary points,
e. use this x coordinate as the beginning point for the next search
   at the next height
f. continue this upward path until the diff of the left and right
   extents become smaller than from the earlier height
g. the logic is that the stem should become wider and wider at its
   source of origin
\item find the max lateral radius
a. at each point, consider its lateral distance to the x-value of
   the stem if it is not white
b. the max lateral radius will be the max of such measurements
\item find the max radius
a. this is similar to 3, but calculate the point to point distance
   between the point considered and the x, y coordinates of the
   stem
b. the max radius will be the max of such measurements
\end{enumerate}
\end{document}
